In [23]:
import pandas as pd

people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMS", "Dogs", "Cats"],
}

In [24]:
df = pd.DataFrame(people)

In [3]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

# ADD COLUMN

In [25]:
df["full_name"] = df["first"] + " " + df["last"]  # add a new column to the dataframe
print(df)

   first     last    email      full_name
0  Corey  Schafer  CoreyMS  Corey Schafer
1   Jane      Doe     Dogs       Jane Doe
2   John      Doe     Cats       John Doe

In [26]:
df["last_cap"] = df["last"].apply(lambda x: x.upper())  # apply a function to a column
print(df)

   first     last    email      full_name last_cap
0  Corey  Schafer  CoreyMS  Corey Schafer  SCHAFER
1   Jane      Doe     Dogs       Jane Doe      DOE
2   John      Doe     Cats       John Doe      DOE

# REMOVE COLUMNS

In [11]:
df.drop(columns=["first", "last"], inplace=True)  # remove columns from the dataframe
df

     email      full_name last_cap
0  CoreyMS  Corey Schafer  SCHAFER
1     Dogs       Jane Doe      DOE
2     Cats       John Doe      DOE

In [10]:
df["full_name"].str.split(
    " ", expand=True
)  # split the full_name column into two columns
# expand = True will return a dataframe instead of a series
# expand = False will return a series with a list of the split values

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [12]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)
# split the full_name column into two columns
df

     email      full_name last_cap  first     last
0  CoreyMS  Corey Schafer  SCHAFER  Corey  Schafer
1     Dogs       Jane Doe      DOE   Jane      Doe
2     Cats       John Doe      DOE   John      Doe

# ADD ROW

In [16]:
df = df._append({"first": "Tony"}, ignore_index=True)  # add a new row to the dataframe
df

     email      full_name last_cap  first     last
0  CoreyMS  Corey Schafer  SCHAFER  Corey  Schafer
1     Dogs       Jane Doe      DOE   Jane      Doe
2     Cats       John Doe      DOE   John      Doe
3      NaN            NaN      NaN   Tony      NaN

In [27]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["IronMan", "Cap"],
}

df2 = pd.DataFrame(people)

In [28]:
df = df._append(df2, ignore_index=True)  # add a new dataframe to the original dataframe
df

   first     last    email      full_name last_cap
0  Corey  Schafer  CoreyMS  Corey Schafer  SCHAFER
1   Jane      Doe     Dogs       Jane Doe      DOE
2   John      Doe     Cats       John Doe      DOE
3   Tony    Stark  IronMan            NaN      NaN
4  Steve   Rogers      Cap            NaN      NaN

# DELETE ROW

In [29]:
# df.drop(index=4)  # remove a row from the dataframe
df = df.drop(index=4)
df

   first     last    email      full_name last_cap
0  Corey  Schafer  CoreyMS  Corey Schafer  SCHAFER
1   Jane      Doe     Dogs       Jane Doe      DOE
2   John      Doe     Cats       John Doe      DOE
3   Tony    Stark  IronMan            NaN      NaN

In [30]:
filt = df['last'] == 'Doe'

df = df.drop(
    index=df[filt].index
)  # remove rows from the dataframe based on a condition
df

   first     last    email      full_name last_cap
0  Corey  Schafer  CoreyMS  Corey Schafer  SCHAFER
3   Tony    Stark  IronMan            NaN      NaN